Repository: 84000/data-translation-memory
Catalog: toh235-v3.tmx
Source language: bo
Languages: en

source: ཀླུ་ཆེན་པོ་དག་སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་བདེན་པས་འཛམ་བུའི་གླིང་འདིར་ཆར་རབ་ཏུ་ཕོབ་ཤིག་སྭཱ་ཧཱ།
en: Great nāgas, by the verity of all the buddhas and bodhisattvas, send down rainfall here in the continent of Jambudvīpa, svāhā.

source: ཀླུ་ཆེན་པོ་དག་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་བདེན་པ་དང་བྱིན་གྱི་རླབས་ཀྱིས་འཛམ་བུའི་གླིང་འདིར་ཆར་རབ་ཏུ་ཕོབ་ཤིག་སྭཱ་ཧཱ།
en: Great nāgas, by the verity and blessings of all the tathāgatas, send down rainfall here in the continent of Jambudvīpa, svāhā.

source: ལྷ་ཐམས་ཅད་ཀྱི་བདེན་པས་གནོད་པ་ཐམས་ཅད་ཞི་བར་གྱིས་ཤིག་སྭཱ་ཧཱ།
en: By the verity of all gods, pacify all harm, svāhā.

source: ཀླུ་ཐམས་ཅད་ཀྱི་བདེན་པས་ས་ཆེན་པོ་འདིར་རབ་ཏུ་ཆར་ཕོབ་ཤིག་སྭཱ་ཧཱ།
en: By the verity of all nāgas, send rainfall down here to the great earth, svāhā.

source: གནོད་སྦྱིན་ཐམས་ཅད་ཀྱི་བདེན་པས་སེམས་ཅན་ཐམས་ཅད་སྲུངས་ཤིག་སྭཱ་ཧཱ།
en: By the verity of all yakṣas, protect all sentient beings, svāhā.

source: དྲི་ཟ་ཐམས་ཅད་ཀྱི་བདེན་པས་མི་རྣམས་ཀྱི་འཁྲུག་པ་དང་གནོད་པ་ཐམས་ཅད་སོལ་ཅིག་སྭཱ་ཧཱ།
en: By the verity of all gandharvas, remove all conflict and harm among people, svāhā.

source: ལྷ་མ་ཡིན་ཐམས་ཅད་ཀྱི་བདེན་པས་རྒྱུ་སྐར་མ་རུངས་པ་ཐམས་ཅད་རྣམ་པར་ཟློག་ཅིག་སྭཱ་ཧཱ།
en: By the verity of all asuras, turn back all malignant constellations, svāhā.

source: ནམ་མཁའ་ལྡིང་ཐམས་ཅད་ཀྱི་བདེན་པས་ཀླུ་ཐམས་ཅད་བྱམས་པར་བྱོས་ལ་འཛམ་བུའི་གླིང་འདིར་ཆར་ཆེན་པོའི་རྒྱུན་ཕོབ་ཤིག་སྭཱ་ཧཱ།
en: By the verity of all garuḍas, make all the nāgas act with loving-kindness and send down a great flow of rainfall here in the continent of Jambudvīpa, svāhā.

source: མི་འམ་ཅི་ཐམས་ཅད་ཀྱི་བདེན་པས་སྡིག་པ་ཐམས་ཅད་ཞི་བར་གྱིས་ཤིག་སྭཱ་ཧཱ། སེམས་ཅན་ཐམས་ཅད་ཚིམ་པར་གྱིས་ཤིག་སྭཱ་ཧཱ།
en: By the verity of all kinnaras, pacify all evil and satisfy all sentient beings, svāhā.

source: ལྟོ་འཕྱེ་ཆེན་པོ་ཐམས་ཅད་ཀྱི་བདེན་པས་ཡངས་ཤིང་རྒྱ་ཆེ་བའི་ཆར་གྱི་རྒྱུན་ཕོབ་ཤིག་སྭཱ་ཧཱ། འདིར་ཆར་ལ་སྒྲིབ་པ་ལྔ་པོ་དག་ཡང་དག་པར་ཟུང་ཤིག་སྭཱ་ཧཱ།
en: By the verity of all mahoragas, send down a broad and vast flow of rainfall and seize the five hindrances to rainfall, svāhā.

source: མི་ཐམས་ཅད་ཀྱི་བདེན་པས་མི་ཐམས་ཅད་ལ་ཡོངས་སུ་སྲུངས་ཤིག་སྭཱ་ཧཱ། ཀ་རཀ་ར། ཀི་རི་ཀི་རི། ཀུ་རུ་ཀུ་རུ། ད་ར་ད་ར། དི་རི་དི་རི། དུ་རུ་དུ་རུ། ན་ཊ་ན་ཊ། ནི་ཊི་ནི་ཊི། ནུ་ཊུ་ནུ་ཊུ། ཤིན་ཏུ་མགྱོགས་པར་བཞུད་མ། སྤྲིན་ཆེན་པོའི་ཆུ་འཛིན་མ། སྤྲིན་ལྡན་མ། སྤྲིན་ཆེན་ལྡན་མ། སྤྲིན་ཆེན་ཆུ་འཛིན་མ། སྤྲིན་གསལ་མ། སྤྲིན་འབྱུང་མ། དུས་སྤྲིན་མ། སྤྲིན་གྱི་འབྱུང་གནས་མ། སྤྲིན་སྒྲོགས་མ། སྤྲིན་བཞུགས་མ། སྤྲིན་གྱི་ཅོད་པན་ལྡན་མ། སྤྲིན་གྱི་ཕྲེང་བ་མངའ་མ། སྤྲིན་གྱིས་རྣམ་པར་བརྒྱན་མ། སྤྲིན་བཅིབས་མ། སྤྲིན་ལ་གནས་བཅས་མ། སྤྲིན་གྱི་སྙིང་པོ། སྤྲིན་གྱི་རལ་པ་ཅན། སྤྲིན་འོད་མ། སྤྲིན་གྱི་འཁོར་ལྡན་མ། རྒྱ་ཆེན་སྤྲིན་བཞུགས་མ། མཆོད་ཕྱིར་སྤྲིན་ཐོགས་མ། ལོ་ཐོག་འོངས་སྒྲུབ་མ། རི་སུལ་ན་བཞུགས་མ། ཀླུའི་ཡུམ་བཅོམ་ལྡན་འདས་མ། སྤྲིན་ཆེན་དཔལ་ལྡན་སྐར་མདོག་ཅན། བསིལ་རེག་མ།
en: By the verity of all humans, completely protect all people, svāhā.

source: ཚུབ་མ་ཆེན་པོ་སྤྱོད་ཡུལ་མ། ཀླུ་ཆེན་རྣམ་པར་རོལ་མཛད་མ། བཅོམ་ལྡན་འདས་མ། པོན་ཏྲ་བཅུད་ཀྱིས་ལེན་དྲུག་འཛིན་མ། སངས་རྒྱས་ཀྱི་བདེན་པས་འཛམ་བུའི་གླིང་འདིར་ཆར་རབ་ཏུ་དབབ་ཏུ་གསོལ་སྭཱ་ཧཱ། གྷ་ར་གྷ་ར། གྷི་རི་གྷི་རི། གྷུ་རུ་གྷུ་རུ། གྷི་རི་ནི་གྷརི་ནི། གྷུ་མ་གྷུ་མ་གྷུ་མ་གྷུ་མ་གྷུ་མ་གྷུ་མ་གྷུ་མ་གྷུ་མ་གྷུ་མ་རི། དབུ་དགུ་དང་ལྡན་མ། སྤྲིན་ཆེན་ཕྲེང་ལྡན་མ། ཀློག་ཚོགས་ཕྲེང་ལྡན་མ། ལག་གིས་འགྲོ་ཐམས་ཅད་འཛིན་མ། སྤྲིན་ལྟ་བུའི་ན་བཟའ་མན་བསམ། དུག་དྲག་པོ་ཐམས་ཅད་སྤྱོད་ཡུལ་མ། སྤྲིན་བཀོད་པ་ལ་བཅིབས་མ།
en: kara kara kiri kiri kuru kuru dara dara diri diri duru duru naṭa naṭa niṭi niṭi nuṭu nuṭu Lady Swift Departure, Lady Bearer of Great Clouds’ Water, Lady Possessed of Clouds, Lady Possessed of Great Clouds, Lady Great Cloud Water Bearer, Lady Bright Cloud, Lady Cloud Born, Lady Seasonal Cloud, Lady Cloud Source, Lady Cloud Roar, Lady Cloud Dweller, Lady with a Cloud Crown, Lady Cloud Garland Wearer, Lady Adorned by Clouds, Lady Cloud Mount, Lady Cloud Home, Cloud Essence, Cloud Locks, Cloud Light, Having a Retinue of Clouds, Lady Who Abides in Vast Clouds, Lady Holding Clouds as Offerings, Lady Bringing Harvest, Lady Mountain Dweller, Nāga Mother Bhagavatī, Great Cloud with the Glorious Color of Stars, Lady Cool, Lady Whose Domain Is a Great Storm, Lady Who Manifests the Great Nāgas, Bhagavatī, Lady Who Holds the Six Extracted Essences—by the verity of the Buddha, please send down rainfall here in the continent of Jambudvīpa, svāhā.

source: འབྲུག་སྒྲོགས་མ། སྒྲ་སྒྲོགས་མ། ཀླུའི་ཚོགས་ལ་སྐུལ་མ། ལྷ་མོ་སྤྲིན་ཆེན་ཕྲེང་ལྡན་མ། ཀླུ་ཐམས་ཅད་ལ་མ་ཤོལ་བར་དེ་བཞིན་གཤེགས་པའི་བྱིན་གྱི་རླབས་ཀྱིས་འཛམ་བུའི་གླིང་འདིར་ཆར་ཕོབ་ཤིག་ཅེས་བསྐུལ་དུ་གསོལ་སྭཱ་ཧཱ། ཡ་ར་ཡ་ར། ཡི་རི་ཡི་རི། ཡུ་རུ་ཡུ་རུ། ཛ་ར་ཛ་ར། ཛི་རི་ཛི་རི། ཛུ་རུ་ཛུ་རུ། ཛྷ་ར་ཛྷ་ར། གུ་ཏུ་གུ་ཏུ། གུ་གུ་ཏུ། ག་ཊ་ག་ཊ། གི་ཊི་གི་ཊྭི། ཧ་ར་ཧ་ར། ཧི་ལི་ཧི་ལི། མུ་ལུ་མུ་ལུ། ཏ་ལ་ཏ་ལ། ཏི་ལི་ཏི་ལི། ཏུ་ལུ་ཏུ་ལུ། ཧ་ན་ཧ་ན། ད་ཧ་ད་ཧ། པ་ཙ་པ་ཙ། གྲྀཧྞ་གྲྀཧྞ། མར་དམར་ད། པྲ་མར་ད་པྲ་བརཤ་བིག་ནན། མ་ཏྲེ་ཡོད་ཉཱ་པ་ཡ་ཏི། སྭཱ་ཧཱ། བུད་དྷེ་བུད་དྷེ། བུ་བུད་དྷེ། སུ་བུད་དྷེ། ཧ་ར་པཱ་པ་ན། སརྦ་ས་ཏྭཱ་ནཱན། ཨ་དྷིཤ་ཡ་པུ་ཎྱ་མ། སརྦ་བུད་དྷ་ནཱན། དྷ་རི་ནི་དྷ་རེ། ཤུ་བྷ་མ་ཏེ། གུ་ཎཱ་གྲཔྲཱ་པ་ནེ། མ་ཧཱ་ཛྙཱ་ནོ་ལ་ཀེ །ཤུཀླ་དྷརྨེ།
en: ghara ghara ghiri ghiri ghuru ghuru ghiriṇi ghiriṇi ghuma ghuma ghuma ghuma ghuma ghuma ghuma ghuma ghumari Lady Endowed with Nine Heads, Lady Endowed with a Great Cloud Garland, Lady with a Garland of Lightning, Lady Who Holds All Slitherers, Lady Wearing Cloud-Like Raiment, Lady with the Domain of All Strong Poisons, Lady Mounted on Arrayed Clouds, Lady Dragon’s Roar, Lady Roar, Lady Who Incites Nāgas, Goddess Possessing a Garland of Great Clouds—exhort all the nāgas, saying, ‘Without delay, through the blessings of the Tathāgata, send down rainfall here in the continent of Jambudvīpa,’ svāhā.

source: སངྱ་པྲ་ཏི་ཛྙཱ། མ་ཧཱ་ཡཱ་ནཱ་དྷྱུ་ཥི་ཏེ་ལོ་ཀ་ཛྱཻཥྛ་བྷ་ག་བ་ཏི། བུད་དྷ་མཻ་ཏྲེ་ཨ་ཡུ་བུ་ར་ཡ་སརྦ་ཀྵེ་ཏྲཱ་ནི། ཤུ་ཀླེ་ཤྭེ་ཏྭམ། པ་ར་དཱ་རེ། པ་ན་ཊ་ར་བ་སི་ནི། དྷུ་དྷུ་རུ།
en: yara yara yiri yiri yuru yuru jara jara jiri jiri juru juru jhara jhara gutu gutu gugutu gaṭa gaṭa giṭi giṭi hara hara hili hili mulu mulu tala tala tili tili tulu tulu hana hana daha daha paca paca gṛhṇa gṛhṇa marda marda pramarda pravarśa vignan maitreya ājñāpayati svāhā buddhe buddhe bubuddhe subuddhe hara pāpana sarva satvānān adhiṣṭhayapuṇyama sarva buddhanān dharini dhare śubhamate guṇāgraprāpane mahājñānolake śukladharme sadyapratijñā mahāyānādhyuṣite lokajyeṣṭhabhagavati buddhamaitreyayuvuraya sarva kṣetrāni śukleśvetvama paradāre panaṭaravasini dhudhure dhudhuru śama śama śāntamānase May you completely clear away all hindrances to rainfall, svāhā.

source: ཤ་མ་ཤ་མ། ཤཱནྟ་མཱ་ན་སེ། ཆར་གྱི་བགེགས་ཐམས་ཅད་རྣམ་པར་བསལ་བར་གསོལ་སྭཱ་ཧཱ། དུས་གསུམ་གྱི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་བདེན་པས་བྱམས་པའི་ཐུགས་ཀྱིས་ཡང་དག་པ་བརྟུལ་ཞུགས་དང་། དཀའ་ཐུབ་ཀྱི་ཐུགས་སྐྱོན་མེད་པས་ཀླུ་ཆེན་པོ་རྣམས་ལ་ཡང་དག་པར་བསྐུལ་ལོ།
en: By the verity of all the tathāgatas of the three times, who engage in perfect conduct with minds of loving-kindness and possess flawless minds of austerity, we exhort all the great nāgas.

source: །ཀླུའི་རྒྱལ་པོ་ཆེན་པོ་གཡོག་མཐའ་ཡས་རྒྱ་མཚོའི་སྤྲིན་བཀོད་པའི་གཟི་བརྗིད་ཀྱི་དཀྱིལ་འཁོར་གདུགས་ལྟ་བུའི་རྒྱལ་པོ་ལ་ཡང་དག་པར་བསྐུལ་ལོ། །འཛམ་བུའི་གླིང་འདིར་རབ་ཏུ་ཆར་ཕོབ་ཤིག་སྭཱ་ཧཱ།
en: Great nāga king Ananta­parikara­sāgara­megha­vyūha­tejo­maṇḍala­chartākāra­rāja, we exhort you—send down rainfall here in the continent of Jambudvīpa, svāhā.

source: ཀླུའི་རྒྱལ་པོ་དགའ་བོ་དང་ཉེ་དགའ་ལ་ཡང་དག་པར་བསྐུལ་ལོ། །འཛམ་བུའི་གླིང་འདིར་རབ་ཏུ་ཆར་ཕོབ་ཤིག་སྭཱ་ཧཱ།
en: Great nāga kings Nanda and Upananda, we exhort you—send down rainfall here in the continent of Jambudvīpa, svāhā.

source: ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོ་ལ་ཡང་དག་པར་བསྐུལ་ལོ། །འཛམ་བུའི་གླིང་འདིར་རབ་ཏུ་ཆར་ཕོབ་ཤིག་སྭཱ་ཧཱ།
en: Great nāga king Sāgara, we exhort you— send down rainfall here in the continent of Jambudvīpa, svāhā.

source: ཀླུའི་རྒྱལ་པོ་མ་དྲོས་པ་ལ་ཡང་དག་པར་བསྐུལ་ལོ། །འཛམ་བུའི་གླིང་འདིར་རབ་ཏུ་ཆར་ཕོབ་ཤིག་སྭཱ་ཧཱ།
en: Great nāga king Anavatapta, we exhort you—send down rainfall here in the continent of Jambudvīpa, svāhā.

source: ཀླུའི་རྒྱལ་པོ་གཟི་ཅན་ལ་ཡང་དག་པར་བསྐུལ་ལོ། །འཛམ་བུའི་གླིང་འདིར་ཆར་རབ་ཏུ་ཕོབ་ཤིག་སྭཱ་ཧཱ།
en: Great nāga king Manasvin, we exhort you—send down rainfall here in the continent of Jambudvīpa, svāhā.

source: ཀླུའི་རྒྱལ་པོ་ཆུ་ལྷ་ལ་ཡང་དག་པར་བསྐུལ་ལོ། །འཛམ་བུའི་གླིང་འདིར་ཆར་རབ་ཏུ་ཕོབ་ཤིག་སྭཱ་ཧཱ།
en: Great nāga king Varuṇa, we exhort you—send down rainfall here in the continent of Jambudvīpa, svāhā.

source: ཀླུའི་རྒྱལ་པོ་འཇོག་པོ་ལ་ཡང་དག་པར་བསྐུལ་ལོ། །འཛམ་བུའི་གླིང་འདིར་ཆར་རབ་ཏུ་ཕོབ་ཤིག་སྭཱ་ཧཱ།
en: Great nāga king Takṣaka, we exhort you—send down rainfall here in the continent of Jambudvīpa, svāhā.

source: ཀླུའི་རྒྱལ་པོ་ཡུལ་འཁོར་སྲུང་ལ་ཡང་དག་པར་བསྐུལ་ལོ། །འཛམ་བུའི་གླིང་འདིར་ཆར་རབ་ཏུ་ཕོབ་ཤིག་སྭཱ་ཧཱ།
en: Great nāga king Dhṛtarāṣṭra, we exhort you—send down rainfall here in the continent of Jambudvīpa, svāhā.

source: ཀླུའི་རྒྱལ་པོ་ནོར་རྒྱས་ཀྱི་བུ་ལ་ཡང་དག་པར་བསྐུལ་ལོ། །འཛམ་བུའི་གླིང་འདིར་ཆར་རབ་ཏུ་ཕོབ་ཤིག་སྭཱ་ཧཱ།
en: Great nāga king Vāsuki, we exhort you—send down rainfall here in the continent of Jambudvīpa, svāhā.

source: ཀླུའི་རྒྱལ་པོ་བཏང་བཟུང་ལ་ཡང་དག་པར་བསྐུལ་ལོ། །འཛམ་བུའི་གླིང་འདིར་ཆར་རབ་ཏུ་ཕོབ་ཤིག་སྭཱ་ཧཱ།
en: Great nāga king Mucilinda, we exhort you—send down rainfall here in the continent of Jambudvīpa, svāhā.

source: ཀླུའི་རྒྱལ་པོ་ས་སྲུང་གི་བུ་ལ་ཡང་དག་པར་བསྐུལ་ལོ། །འཛམ་བུའི་གླིང་འདིར་ཆར་རབ་ཏུ་ཕོབ་ཤིག་སྭཱ་ཧཱ།
en: Great nāga king Airāvaṇa, we exhort you—send down rainfall here in the continent of Jambudvīpa, svāhā.

source: ཀླུའི་རྒྱལ་པོ་ནུ་ཏ་ལ་ཡང་དག་པར་བསྐུལ་ལོ། །འཛམ་བུའི་གླིང་འདིར་ཆར་རབ་ཏུ་ཕོབ་ཤིག་སྭཱ་ཧཱ།
en: Great nāga king Nuta, we exhort you—send down rainfall here in the continent of Jambudvīpa, svāhā.

source: ཀླུའི་རྒྱལ་པོ་དཔལ་གྱི་གཟི་བརྗིད་ལ་ཡང་དག་པར་བསྐུལ་ལོ། །འཛམ་བུའི་གླིང་འདིར་ཆར་རབ་ཏུ་ཕོབ་ཤིག་སྭཱ་ཧཱ།
en: Great nāga king Śrītejas, we exhort you—send down rainfall here in the continent of Jambudvīpa, svāhā.

source: ཀླུའི་རྒྱལ་པོ་དཔའ་བཟངས་ལ་ཡང་དག་པར་བསྐུལ་ལོ། །འཛམ་བུའི་གླིང་འདིར་ཆར་རབ་ཏུ་ཕོབ་ཤིག་སྭཱ་ཧཱ།
en: Great nāga king Śrībhadra, we exhort you—send down rainfall here in the continent of Jambudvīpa, svāhā.

source: ཀླུའི་རྒྱལ་པོ་གློག་གི་ཕྲེང་བ་ལ་ཡང་དག་པར་བསྐུལ་ལོ། །འཛམ་བུའི་གླིང་འདིར་ཆར་རབ་ཏུ་ཕོབ་ཤིག་སྭཱ་ཧཱ།
en: Great nāga king Vidyunmālin, we exhort you—send down rainfall here in the continent of Jambudvīpa, svāhā.

source: ཀླུའི་རྒྱལ་པོ་གཙུག་ན་ནོར་བུ་ཆེན་པོ་ལ་ཡང་དག་པར་བསྐུལ་ལོ། །འཛམ་བུའི་གླིང་འདིར་ཆར་རབ་ཏུ་ཕོབ་ཤིག་སྭཱ་ཧཱ།
en: Great nāga king Mahāmaṇicūḍa, we exhort you—send down rainfall here in the continent of Jambudvīpa, svāhā.

source: ཀླུའི་རྒྱལ་པོ་གཙུག་ན་ནོར་བུ་ཐོགས་ལ་ཡང་དག་པར་བསྐུལ་ལོ། །འཛམ་བུའི་གླིང་འདིར་ཆར་རབ་ཏུ་ཕོབ་ཤིག་སྭཱ་ཧཱ།
en: Great nāga king Cūḍāmaṇidhara, we exhort you—send down rainfall here in the continent of Jambudvīpa, svāhā.

source: ཀླུའི་རྒྱལ་པོ་སྣང་ལྡན་གཙུག་པུད་ཅན་ལ་ཡང་དག་པར་བསྐུལ་ལོ། །འཛམ་བུའི་གླིང་འདིར་ཆར་རབ་ཏུ་ཕོབ་ཤིག་སྭཱ་ཧཱ།
en: Great nāga king Avabhāsanaśikhin, we exhort you—send down rainfall here in the continent of Jambudvīpa, svāhā.

source: དེ་དག་ལ་སོགས་པ་ཀླུའི་རྒྱལ་པོ་ཐམས་ཅད་ལ་ཡང་དག་པར་བསྐུལ་ལོ། །འཛམ་བུའི་གླིང་འདིར་ཆར་རབ་ཏུ་ཕོབ་ཤིག་སྭཱ་ཧཱ། ནཱ་གེ་ན་གེ། །མ་ཧཱ་ནཱ་གེ །གྷོ་ར་མཱ་ན་སེ། ནཱ་ག་ཧྲྀད་ཡ། དྷུ་མཀུ་ལེ། ཨུ་གྲ་རོ་ཥེ། པྲ་ཙཎྜ་ཏེ་ཛོ། བི་ཥོ་གྲེ། ཨཱ་ཤཱ་བི་ཤེ། ཨ་ཧི་གྷོ་རེ། ཀྲིཥྼ་པིང་ག་ལེ། ཙ་ན་ཙ་ལེ། ལོ་ལ་ཛི་ཧྭེ།
en: These and all other nāga kings, we exhort you—send down rainfall here in the continent of Jambudvīpa, svāhā.

source: མ་ཧཱ་ཕ་ན་ཀ་རེ། ཀཱ་ལ་པཱ་ཤེ། རཽཾ་དྲ་བཱ་སི་ནི། ཊུ་ཊུ་མ་བེ། གྷ་ཎ་གྷ་ཎ། ཤི་ཁི་ནི། ཀ་ཎ་ཀ་ཎ། ག་ཎ་ག་ཎ། མ་ཧཱ་ག་ཎ་ག་ཎེ། པ་ར་པ་ར། པི་རི་པི་རི། པུ་རུ་པུ་རུ། བི་སྥུརྫ་ནེ། བྷུ་རུ་བྷུ་རུ། མ་ཧཱ་བྷོ་གེ །མ་ཎི་དྷ་རི། ཕི་རི་ཕི་རི། ཕུ་རུ་ཕུ་རུ། ཕ་ར་ཕ་ར། བར་ཥ་བར་ཥ། ཛ་ལཱམ་བུ་དྷ་རེ། ཤམ་བུ་ཤམ་བུ། བ་ཏ་ཌུ་ཏུམ་པེ། དྷུད་དྷུད་དྷུདདྷུམ་བེ། མེ་གྷ་པྲ་བྷེ། མེ་གྷ་བཱ་ཧིནེ། ཌྷ་ཀ་ཌྷ་ཀ་ཌྷ་ཀ་ཌྷུ་ཌྷུམ་བེ། གྷ་ཎཱ་གྷ་ཎཱ། ཤི་ཀི་ནི། ཀ་ན་ཀ་ན། ག་ཎ་ག་ཎ། མ་ཧཱ་ནཱ་ག་ག་ནེ། ནི་རཱ་ཏྲ་ཎྱ། པ་ཛ་ར་ད་ཀཱ་རི་མ་ཧཱ་ནཱ་གཱ་དྷི་བ་ཏ་ཡེ། གྷུ་མ་གྷུ་མ་གྷུ་མ་པ་ཡ་སྟི་ཀ། ཛཱང་གཱ་རི་བྷུ་ཛང་ཤ་མེ། པི་ཀ་ཏ་སང་ཀ་ཏེ།
en: nāge nāge mahānāge ghoramānase nāga­hṛdaya dhuma kule ugraroṣe pracaṇḍa­tejo viṣogre āśāviśe atighore kṛṣṇa­piṇgale canacale lolajihve mahā­phanakare kālapāśe raudra­vāsani ṭuṭumāve ghaṇa ghaṇa śikhini kaṇa kaṇa gaṇa gaṇa mahā­gaṇagaṇe para para piri piri puru puru visphurjane bhuru bhuru mahābhoge maṇi­dhari phiri phiri phuru phuru phara phara varṣa varṣa jalāmbudhare ṣambu ṣambu vataḍutampe dhud dhud dhud dhumve megha­prabhe meghavātine ḍhaka ḍhaka ḍhaka ḍhu ḍhumve ghaṇā ghaṇā śikini kana kana gaṇa gaṇa mahā­nāgagane nirātraṇya vajra dakāri mahā­nāgādhivataye ghuma ghuma ghuma payāstika jāṅgārighujaṃśame pikatasaṅkate ghora­visphurjani vijṛmabhante All nāgas, you are summoned.

source: གྷོ་ར་བི་སྥུརྫ་ནི་བི་ཛྲྀམ་བྷནྟེ། ཀླུ་ཐམས་ཅད་དགུག་གོ། །སངས་རྒྱས་ཐམས་ཅད་ཀྱི་བྱིན་གྱི་རླབས་དང་། དུས་གསུམ་གྱི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་བདེན་པ་དང་། བྱམས་པའི་ཐུགས་ཀྱིས་འཛམ་བུའི་གླིང་འདིར་ཆར་རབ་ཏུ་ཕོབ་ཤིག་སྭཱ་ཧཱ།
en: Through the blessings of all buddhas and the word and minds of loving-kindness of all the tathāgatas of the three times, send down rainfall here in the continent of Jambudvīpa, svāhā.

source: ན་མཿསརྦ་བུ་ངྡྷེ་བྷྱཿསིད་དྷན་ཏུ་མནྟྲ་པ་དཱ་ནི་སྭཱ་ཧཱ། འཕགས་པ་སྤྲིན་ཆེན་པོ་ཐེག་པ་ཆེན་པོའི་མདོ། སྟོང་ཕྲག་བརྒྱ་པ་ལས་ཆར་དབབ་པ་རླུང་གི་དཀྱིལ་འཁོར་ཅེས་བྱ་བའི་ལེའུ་སྟེ་དྲུག་ཅུ་རྩ་བཞིའོ།། །།
en: namaḥ sarvabuddhebhyaḥ sidhyantu mantrapadāni svāhā” From the hundred thousand lines of the noble Mahāyāna sūtra “The Great Cloud,” this is the sixty-fourth chapter, entitled “The Array of Winds That Send Down Rainfall.”

source: ཆོ་ག་ནི་ཆར་ཆེར་དབབ་པར་འདོད་ན་བླ་གབ་མེད་པའི་ས་ཕྱོགས་གཙང་མར་བླ་རེ་སྔོན་པོ་བྲེ། བ་དན་སྔོན་པོ་དཔྱང་ངོ་།
en: Ritual Procedure One who desires to produce a great rainfall should first go to an open, clean area and erect a blue canopy, decorating it with blue pennants.

source: །ཆོས་སྨྲ་བ་ལུས་བཀྲུས་ལ་ཡན་ལག་བརྒྱད་པ་ལ་ཉེ་བར་གནས་ཤིང་གོས་གཙང་མ་སྔོན་པོ་བགོས་ལ།
en: The Dharma practitioner should bathe their body, abide by the eightfold precepts, and don clean blue garments.

source: སྤོས་དྲི་ཞིམ་པོས་བསྐུས་ནས་ཟས་དཀར་གསུམ་ཟོས་ལ་སྟན་སྔོན་པོའི་སྟེང་དུ་འདུག་ནས། ཁ་ཤར་ཕྱོགས་སུ་བལྟས་ཏེ།
en: Having anointed themselves with pleasant-smelling incense, they should consume the three white foods and seat themselves upon a blue cushion, facing east.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ལ་གསོལ་བ་བཏབ་ནས་སྤྲིན་ཆེན་པོའི་དཀྱིལ་འཁོར་གྱི་ལེའུ་འདི་ཉིན་མཚན་རྒྱུན་མི་འཆད་པར་བཀླག་པར་བྱའོ།
en: After supplicating all the tathāgatas, they should read aloud this chapter on the array of winds from The Great Cloud, day and night without interruption.

source: །ཆུ་སྔོན་པོས་བཀང་བའི་བུམ་པ་གང་བ་བཞི་གཞག་པར་བྱའོ། །གཏོར་མ་དང་། བདུག་པ་དང་། མེ་ཏོག་ཅི་ནུས་ཀྱིས་སྦྱར་རོ།
en: They should set out four vases filled with blue water, together with as much offering cakes, incense, and flowers as they can gather.

source: །དེ་ལ་ཆོས་སྨྲ་བས་ཕྱོགས་བཞིར་བའི་ལྕི་བའི་ཁུ་བས་བྲི་བར་བྱ་སྟེ།
en: The Dharma practitioner should then use liquified cow dung to draw figures in the four directions.

source: ཤར་ཕྱོགས་སུ་ཁྲུ་གསུམ་ཙམ་དུ་ཀླུའི་རྒྱལ་པོ་མགོ་གསུམ་པ་ཀླུའི་གཡོག་འཁོར་སྣ་ཚོགས་དང་བཅས་པ་བའི་ལྕི་བས་བྲི་བར་བྱའོ།
en: In the eastern direction they should use cow dung to draw a three-headed nāga king, three cubits tall, with a retinue of various nāga attendants.

source: །ལྷོ་ཕྱོགས་སུ་ཁྲུ་ལྔ་ཙམ་དུ་ཀླུའི་རྒྱལ་པོ་མགོ་ལྔ་པ་ཀླུའི་གཡོག་འཁོར་སྣ་ཚོགས་དང་བཅས་པ་བྲི་བར་བྱའོ།
en: In the southern direction they should draw a five-headed nāga king, five cubits tall, with a retinue of various nāga attendants.

source: །ནུབ་ཕྱོགས་སུ་ཁྲུ་བདུན་ཙམ་དུ་ཀླུའི་རྒྱལ་པོ་མགོ་བདུན་པ་ཀླུའི་གཡོག་འཁོར་སྣ་ཚོགས་དང་བཅས་པ་བྲི་བར་བྱའོ།
en: In the western direction they should draw a seven-headed nāga king, seven cubits tall, with a retinue of various nāga attendants.

source: །བྱང་ཕྱོགས་སུ་ཁྲུ་དགུ་ཙམ་དུ་ཀླུའི་རྒྱལ་པོ་མགོ་དགུ་པ་ཀླུའི་གཡོག་འཁོར་སྣ་ཚོགས་དང་བཅས་པ་བྲི་བར་བྱའོ།
en: In the northern direction they should draw a nine-headed nāga king, nine cubits tall, with a retinue of various nāga attendants.

source: །ཆོས་སྨྲ་བས་རང་གི་ལུས་བསྲུངས་ལ་བྱམས་པ་ལ་གནས་ཏེ་སེམས་ཅན་ཐམས་ཅད་ལ་སྙིང་རྗེའི་སེམས་ཉེ་བར་གཞག་ནས་སངས་རྒྱས་དང་།
en: The Dharma practitioner should guard their own body, abiding in loving-kindness, and establish an attitude of compassion toward all sentient beings.

source: བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་གསོལ་བ་བཏབ་ལ་ཀླུ་རྣམས་དང་དགེ་བའི་རྩ་བ་བགོ་བར་བྱ་སྟེ།
en: Then, they should supplicate all the buddhas and bodhisattvas and share the virtuous roots with the nāgas.

source: འདི་ནི་ཆོ་གའོ།
en: This is the ritual procedure.

source: །གང་ཞིག་ཆར་མི་འབབ་པའི་ཚེ། སྤྲིན་ཆེན་པོའི་རླུང་གི་དཀྱིལ་འཁོར་གྱི་ལེའུ་འདི་ཀློག་ན། ཉིན་ཞག་གཅིག་གམ། གཉིས་ནས་ཉིན་ཞག་བདུན་ཚུན་ཆད་གདོན་མི་ཟ་བར་ཆར་འབབ་པར་འགྱུར་རོ།
en: If one reads aloud this chapter on the array of winds from The Great Cloud during a time of drought, then within one full day, two full days, or up to seven full days, it is certain that rain will fall.

source: །རྒྱ་མཚོ་ནི་དུས་ལས་ཡོལ་ཀྱང་སྲིད་ཀྱི། ཐུབ་པ་ཆེན་པོའི་གསུང་རབ་ཆར་གྱི་ཆོ་ག་འདི་ནི་གཞན་དུ་མི་འགྱུར་རོ།
en: The ocean may recede with the tides, but this ritual for bringing rainfall, the speech of the Great Sage, will never change.

source: །དེ་ལྟ་མོད་ཀྱི་ཚུལ་ཁྲིམས་དང་ཡོན་ཏན་ལ་གནས་ཏེ། འཆལ་པའི་ཚུལ་ཁྲིམས་དང་། ཤ་དང་ཉ་ལ་སོགས་པ་ཡོངས་སུ་སྤང་བར་བྱའོ།
en: That being the case, however, one must abide in discipline and virtuous qualities and abandon lax discipline, meat, fish, and the like.

source: །འོ་ཐུག་དང་ཞོ་དང་འོ་མ་དང་། འབྲས་ཆན་བུ་རམ་ཅན་ལ་སོགས་པ་དང་། མངར་གསུམ་ཟ་ཞིང་བཀླག་པར་བྱའོ།
en: One should consume rice gruel, curds, milk, rice with sugar, the three sweets, and so forth.

source: །དེ་ལྟར་ན་འགྲུབ་པར་འགྱུར་ཏེ་ཐུབ་པའི་རྒྱལ་པོས་གསུངས་པ་བཞིན་དུ་ཐེ་ཚོམ་མེད་པར་བྱའོ།
en: In this fashion, the ritual will be successful. As this was spoken by the King of Sages, there should be no doubts about this.

source: །འཕགས་པ་སྤྲིན་ཆེན་པོ་ཐེག་པ་ཆེན་པོའི་མདོ་ལས་ཆར་དབབ་པ་རླུང་གི་དཀྱིལ་འཁོར་གྱི་ལེའུ་ཞེས་བྱ་བ་དྲུག་ཅུ་རྩ་བཞི་པ་ཆོ་ག་དང་བཅས་པ་རྫོགས་སོ།། །།
en: From the noble Mahāyāna sūtra “The Great Cloud,” this is the sixty-fourth chapter “The Array of Winds That Send Down Rainfall” together with its ritual manual.

source: རྒྱ་གར་གྱི་མཁན་པོ་ཛི་ན་མི་ཏྲ་དང་། ཤཱི་ལེན་དྲ་བོ་དྷི་དང་། ཞུ་ཆེན་གྱི་ལོ་ཙཱ་བ་བན་དེ་ཡེ་ཤེས་སྡེས་བསྒྱུར་ཅིང་ཞུས་ཏེ་སྐད་གསར་ཆད་ཀྱིས་ཀྱང་བཅོས་ནས་གཏན་ལ་ཕབ་པ།།
en: Translated, revised, and finalized according to the new terminology by the Indian preceptors Jinamitra and Śīlendrabodhi and the great editor-translator Bandé Yeshé Dé.
